tests/fixtures/artifact-replay/multi-region-success/case/0/fluid/nut
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    topAndBottom
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
    fluid_to_solid
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}
