tests/fixtures/artifact-replay/multi-region-success/case/0/fluid/omega
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      omega;
}

dimensions      [0 0 -1 0 0 0 0];
internalField   uniform 10;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 10;
    }
    outlet
    {
        type            zeroGradient;
    }
    topAndBottom
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    fluid_to_solid
    {
        type            omegaWallFunction;
        value           uniform 10;
    }
}
