tests/fixtures/artifact-replay/multi-region-success/case/0/fluid/p
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 100000;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 100000;
    }
    outlet
    {
        type            calculated;
        value           uniform 100000;
    }
    topAndBottom
    {
        type            calculated;
        value           uniform 100000;
    }
    frontAndBack
    {
        type            empty;
    }
    fluid_to_solid
    {
        type            calculated;
        value           uniform 100000;
    }
}
