tests/fixtures/artifact-replay/multi-region-success/case/0/fluid/p_rgh
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    topAndBottom
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
    fluid_to_solid
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
}
