tests/fixtures/artifact-replay/multi-region-success/case/0/solid/T
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 297;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    solid_to_fluid
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        Tnbr            T;
        kappaMethod     solidThermo;
        value           uniform 297;
    }
}
