tests/fixtures/artifact-replay/multi-region-success/case/constant/fluid/fvModels
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvModels;
}
