tests/fixtures/artifact-replay/multi-region-success/case/constant/fluid/g
FoamFile
{
    format      ascii;
    class       uniformDimensionedVectorField;
    object      g;
}

dimensions      [0 1 -2 0 0 0 0];
value           (0 0 0);
