tests/fixtures/artifact-replay/multi-region-success/case/constant/fluid/momentumTransport
FoamFile
{
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}

simulationType RAS;

RAS
{
    model           kOmegaSST;
    turbulence      on;
    printCoeffs     on;
}
