tests/fixtures/artifact-replay/multi-region-success/case/constant/fluid/physicalProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    object      physicalProperties;
}

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          eConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight   18.01528;
    }
    equationOfState
    {
        rho         998.19;
    }
    thermodynamics
    {
        Cv          4150;
        Hf          0;
    }
    transport
    {
        mu          1.0005e-3;
        Pr          6.31;
    }
}
