tests/fixtures/artifact-replay/multi-region-success/case/constant/fluid/thermophysicalTransport
FoamFile
{
    format      ascii;
    class       dictionary;
    object      thermophysicalTransport;
}

simulationType RAS;

RAS
{
    model           eddyDiffusivity;
    Prt             0.85;
}
