tests/fixtures/artifact-replay/multi-region-success/case/constant/regionProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    object      regionProperties;
}

regions
(
    fluid (fluid)
    solid (solid)
);
