tests/fixtures/artifact-replay/multi-region-success/case/constant/solid/fvConstraints
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvConstraints;
}
