tests/fixtures/artifact-replay/multi-region-success/case/constant/solid/fvModels
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvModels;
}

volumetricHeating
{
    type            heatSource;
    selectionMode   all;
    q               5e7;
}
