tests/fixtures/artifact-replay/multi-region-success/case/constant/solid/physicalProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    object      physicalProperties;
}

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIsoSolid;
    thermo          eConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight   63.546;
    }
    equationOfState
    {
        rho         8940;
    }
    thermodynamics
    {
        Cv          385;
        Hf          0;
    }
    transport
    {
        kappa       380;
    }
}
