tests/fixtures/artifact-replay/multi-region-success/case/constant/solid/radiationProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    object      radiationProperties;
}

radiationModel  none;
