tests/fixtures/artifact-replay/multi-region-success/case/system/blockMeshDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-0.0025      -0.0025       -0.0025) // 0
    ( 0.0025      -0.0025       -0.0025) // 1
    ( 0.0025       0.0025       -0.0025) // 2
    (-0.0025       0.0025       -0.0025) // 3
    (-0.0035355339 -0.0035355339 -0.0025) // 4
    ( 0.0035355339 -0.0035355339 -0.0025) // 5
    ( 0.0035355339  0.0035355339 -0.0025) // 6
    (-0.0035355339  0.0035355339 -0.0025) // 7
    (-0.04        -0.04         -0.0025) // 8
    ( 0.10        -0.04         -0.0025) // 9
    ( 0.10         0.04         -0.0025) // 10
    (-0.04         0.04         -0.0025) // 11

    (-0.0025      -0.0025        0.0025) // 12
    ( 0.0025      -0.0025        0.0025) // 13
    ( 0.0025       0.0025        0.0025) // 14
    (-0.0025       0.0025        0.0025) // 15
    (-0.0035355339 -0.0035355339  0.0025) // 16
    ( 0.0035355339 -0.0035355339  0.0025) // 17
    ( 0.0035355339  0.0035355339  0.0025) // 18
    (-0.0035355339  0.0035355339  0.0025) // 19
    (-0.04        -0.04          0.0025) // 20
    ( 0.10        -0.04          0.0025) // 21
    ( 0.10         0.04          0.0025) // 22
    (-0.04         0.04          0.0025) // 23
);

blocks
(
    hex (0 1 2 3 12 13 14 15)       (15 15 1) simpleGrading (1 1 1)
    hex (4 5 1 0 16 17 13 12)       (15 12 1) simpleGrading (1 1 1)
    hex (1 5 6 2 13 17 18 14)       (12 15 1) simpleGrading (1 1 1)
    hex (3 2 6 7 15 14 18 19)       (15 12 1) simpleGrading (1 1 1)
    hex (4 0 3 7 16 12 15 19)       (12 15 1) simpleGrading (1 1 1)

    hex (8 9 5 4 20 21 17 16)       (15 30 1) simpleGrading (1 0.20 1)
    hex (5 9 10 6 17 21 22 18)      (30 15 1) simpleGrading (5 1 1)
    hex (7 6 10 11 19 18 22 23)     (15 30 1) simpleGrading (1 5 1)
    hex (8 4 7 11 20 16 19 23)      (30 15 1) simpleGrading (0.20 1 1)
);

edges
(
    arc 4 5  (0 -0.005 -0.0025)
    arc 5 6  (0.005 0 -0.0025)
    arc 6 7  (0 0.005 -0.0025)
    arc 7 4  (-0.005 0 -0.0025)
    arc 16 17 (0 -0.005 0.0025)
    arc 17 18 (0.005 0 0.0025)
    arc 18 19 (0 0.005 0.0025)
    arc 19 16 (-0.005 0 0.0025)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (11 8 20 23)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (9 10 22 21)
        );
    }
    topAndBottom
    {
        type patch;
        faces
        (
            (8 9 21 20)
            (10 11 23 22)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 0 1 5)
            (1 2 6 5)
            (3 7 6 2)
            (4 7 3 0)
            (8 4 5 9)
            (5 6 10 9)
            (7 11 10 6)
            (8 11 7 4)

            (12 13 14 15)
            (16 17 13 12)
            (13 17 18 14)
            (15 14 18 19)
            (16 12 15 19)
            (20 21 17 16)
            (17 21 22 18)
            (19 18 22 23)
            (20 16 19 23)
        );
    }
);

mergePatchPairs ();
