tests/fixtures/artifact-replay/multi-region-success/case/system/fluid/fvSchemes
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         cellLimited Gauss linear 1;
}

divSchemes
{
    default                             none;
    div(phi,U)                          bounded Gauss linearUpwind grad(U);
    div(phi,e)                          bounded Gauss upwind;
    div(phi,h)                          bounded Gauss upwind;
    div(phi,K)                          bounded Gauss upwind;
    div(phi,k)                          bounded Gauss upwind;
    div(phi,omega)                      bounded Gauss upwind;
    "div(phi,(p|rho))"                 Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 0.5;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 0.5;
}

wallDist
{
    method          meshWave;
}
