tests/fixtures/artifact-replay/multi-region-success/case/system/fvSolution
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

PIMPLE
{
    nOuterCorrectors          1;
    nEnergyCorrectors         2;
    nNonOrthogonalCorrectors  0;
}
