tests/fixtures/artifact-replay/multi-region-success/case/system/solid/fvSolution
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    "(e|h)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-9;
        relTol          0.02;
    }
    "(e|h)Final"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 1;
}
